
&НаКлиенте
Процедура кнВыбораПериода(Команда)
		
	Форма = ПолучитьФорму("ВнешняяОбработка.ВыборПериодаУправляемый.Форма.БыстрыйВыборСтандартногоПериода");
	Форма.СтандартныйПериод.ДатаНачала = Объект.ПериодС;
	Форма.СтандартныйПериод.ДатаОкончания = Объект.ПериодПо;
	Форма.Дата = Объект.ПериодС;
	
	РезультатВыбора = Форма.ОткрытьМодально();
	
	Если РезультатВыбора <> Неопределено Тогда
		
	Объект.ПериодС = РезультатВыбора.ДатаНачала;
	Объект.ПериодПо = РезультатВыбора.ДатаОкончания; 
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура кнМесяцРегулирование(Команда)

	ИмяКоманды = Команда.Имя;
	
	Если ИмяКоманды = "кнТекущийМесяц" Тогда
		
		Объект.ПериодС = НачалоМесяца(ТекущаяДата());
		Объект.ПериодПо = КонецМесяца(ТекущаяДата());
		
	Иначе
		
	Если ИмяКоманды = "кнМесяцНазад" Тогда 
		
		ЧислоМесяцев = -1;
		
	ИначеЕсли ИмяКоманды = "кнМесяцВперед" Тогда
		
		ЧислоМесяцев = 1;
		
	КонецЕсли;
	
	Объект.ПериодС = НачалоМесяца(ДобавитьМесяц(Объект.ПериодС, ЧислоМесяцев));
	Объект.ПериодПо = КонецМесяца(Объект.ПериодС);
	
	КонецЕсли;
	
	
КонецПроцедуры
